# Pyber Challenge

### 4.3 Loading and Reading CSV files

In [101]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

# File to Load (Remember to change these)
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

# Read the City and Ride Data
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

### Merge the DataFrames

In [102]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

In [103]:
urban_cities_df=pyber_data_df[pyber_data_df["type"]=="Urban"]
urban_cities_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

In [104]:
suburban_cities_df=pyber_data_df[pyber_data_df["type"]=="Suburban"]
suburban_cities_df.head()

,city,date,fare,ride_id,driver_count,type
1625,Barronchester,2019-01-27 03:08:01,27.79,6653622887913,11,Suburban
1626,East Kentstad,2019-04-07 19:44:19,18.75,6575961095852,20,Suburban
1627,Lake Omar,2019-01-17 21:33:35,21.71,966911700371,22,Suburban
1628,Myersshire,2019-02-27 17:38:39,17.10,5706770909868,19,Suburban
1629,West Hannah,2019-04-19 01:06:59,37.78,2273047151891,12,Suburban

In [105]:
rural_cities_df=pyber_data_df[pyber_data_df["type"]=="Rural"]
rural_cities_df.head()

,city,date,fare,ride_id,driver_count,type
2250,Randallchester,2019-04-13 11:13:31,43.22,1076079536213,9,Rural
2251,North Holly,2019-02-02 14:54:00,12.42,1985256326182,8,Rural
2252,Michaelberg,2019-03-27 18:27:34,54.85,4421836952718,6,Rural
2253,Lake Latoyabury,2019-02-23 21:12:24,47.90,3269652929887,2,Rural
2254,Lake Latoyabury,2019-05-06 08:57:56,51.80,4018025271936,2,Rural

## Deliverable 1: Get a Summary DataFrame

In [143]:
#  1. Get the total rides for each city type

In [144]:
# Rural
rural_ride_count = rural_cities_df.groupby(["city"]).count()["ride_id"]
#rural_ride_count.head()
rural_ride_count=rural_ride_count.sum()
rural_ride_count

125

In [145]:
# Suburban
suburban_ride_count = suburban_cities_df.groupby(["city"]).count()["ride_id"]
#suburban_ride_count.head()
suburban_ride_count=suburban_ride_count.sum()
suburban_ride_count

625

In [146]:
# Urban
urban_ride_count = urban_cities_df.groupby(["city"]).count()["ride_id"]
#urban_ride_count.head()
urban_ride_count = urban_ride_count.sum()
urban_ride_count

1625

In [147]:
# 2. Get the total drivers for each city type

In [148]:
# Rural
rural_driver_count = rural_cities_df.groupby(["city"]).mean()["driver_count"]
rural_driver_count = rural_driver_count.sum()
rural_driver_count

78.0

In [149]:
# Suburban
suburban_driver_count = suburban_cities_df.groupby(["city"]).mean()["driver_count"]
suburban_driver_count = suburban_driver_count.sum()
suburban_driver_count

490.0

In [150]:
# Urban
urban_driver_count = urban_cities_df.groupby(["city"]).mean()["driver_count"]
urban_driver_count = urban_driver_count.sum()
urban_driver_count

2405.0

In [151]:
#  3. Get the total amount of fares for each city type

In [152]:
# Rural
rural_total_amount_fare = rural_cities_df.groupby(["city"]).sum()["fare"]
rural_total_amount_fare = rural_total_amount_fare.sum()
rural_total_amount_fare

4327.93

In [153]:
# Suburban
suburban_total_amount_fare = suburban_cities_df.groupby(["city"]).sum()["fare"]
suburban_total_amount_fare = suburban_total_amount_fare.sum()
suburban_total_amount_fare

19356.33

In [154]:
# Urban
urban_total_amount_fare = urban_cities_df.groupby(["city"]).sum()["fare"]
urban_total_amount_fare = urban_total_amount_fare.sum()
urban_total_amount_fare

39854.38000000001

In [155]:
#  4. Get the average fare per ride for each city type.

In [161]:
# Rural
rural_average_fare_per_ride = rural_total_amount_fare / rural_ride_count
rural_average_fare_per_ride

34.62344

In [162]:
# Suburban
suburban_average_fare_per_ride = suburban_total_amount_fare / suburban_ride_count
suburban_average_fare_per_ride

30.970128000000003

In [163]:
# Urban
urban_average_fare_per_ride = urban_total_amount_fare / urban_ride_count
urban_average_fare_per_ride

24.525772307692314

In [164]:
#  6. Create a PyBer summary DataFrame

In [185]:
city_types = city_data_df["type"].unique() 
city_types= np.sort(city_types) 
city_types

array(['Rural', 'Suburban', 'Urban'], dtype=object)

In [186]:
total_rides_by_type = (rural_ride_count, suburban_ride_count, urban_ride_count)
total_drivers_by_type =(rural_driver_count, suburban_driver_count, urban_driver_count)
total_fares = (rural_total_amount_fare, suburban_total_amount_fare, urban_total_amount_fare)
avgerage_fare_per_ride = (rural_average_fare_per_ride, suburban_average_fare_per_ride, urban_average_fare_per_ride)
avgerage_fare_per_driver = (rural_average_fare_per_driver, suburban_average_fare_per_driver, urban_average_fare_per_driver)

In [187]:
pyber_summary_data_df = pd.DataFrame({
    "City Types" : city_types,
    "Total Rides" : total_rides_by_type,
    "Total Drivers":total_drivers_by_type,
    "Total Fares": total_fares,
    "Average Fare per Ride": avgerage_fare_per_ride,
    "Average Fare per Driver": avgerage_fare_per_driver})
pyber_summary_data_df

,City Types,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
0,Rural,125,78.0,4327.93,34.623440,55.486282
1,Suburban,625,490.0,19356.33,30.970128,39.502714
2,Urban,1625,2405.0,39854.38,24.525772,16.571468

In [188]:
#  7. Cleaning up the DataFrame. Delete the index name
pyber_summary_data_df.index.name = None

In [189]:
#  8. Format the columns.
pyber_summary_data_df["Total Drivers"] = pyber_summary_data_df["Total Drivers"].map("{:.0f}".format)
pyber_summary_data_df["Total Fares"] = pyber_summary_data_df["Total Fares"].map("${:,.2f}".format)
pyber_summary_data_df["Average Fare per Ride"] = pyber_summary_data_df["Average Fare per Ride"].map("${:,.2f}".format)
pyber_summary_data_df["Average Fare per Driver"] = pyber_summary_data_df["Average Fare per Driver"].map("${:,.2f}".format)
pyber_summary_data_df

,City Types,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
0,Rural,125,78,"$4,327.93",$34.62,$55.49
1,Suburban,625,490,"$19,356.33",$30.97,$39.50
2,Urban,1625,2405,"$39,854.38",$24.53,$16.57

## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [192]:
# 1. Read the merged DataFrame

In [193]:
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

In [195]:
pyber_data_df.rename(columns={'city': 'City',
                     'date':'Date',
                     'fare':'Fare', 
                     'ride_id': 'Ride Id',
                     'driver_count': 'No. Drivers', 
                     'type':'City Type'}, inplace=True)
pyber_data_df.head()

,City,Date,Fare,Ride Id,No. Drivers,City Type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

In [196]:
pyber_data_fares_df = pyber_data_df[["Fare", "City Type"]].copy()
pyber_data_fares_df

       Fare City Type
0     13.83     Urban
1     30.24     Urban
2     33.44     Urban
3     23.44     Urban
4     34.58     Urban
...     ...       ...
2370  13.38     Rural
2371  20.76     Rural
2372  11.11     Rural
2373  44.94     Rural
2374  55.84     Rural

[2375 rows x 2 columns]

In [12]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.

In [13]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
# df = df.reset_index()

In [14]:
# 4. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date.

In [15]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'.

In [16]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
# df.index = pd.to_datetime(df.index)

In [17]:
# 7. Check that the datatype for the index is datetime using df.info()

In [18]:
# 8. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.

In [19]:
# 8. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 

# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')

x_axis = pyber_fare_fin_df.index
print(x_axis)